Revit 2027 API
RebarConstraint.IsReferenceAValidEdgeForConstraint Method
 Checks if the reference provided can be used in creating 'ToHostEdge' or 'ToHostEdgeCover' constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsReferenceAValidEdgeForConstraint(
	Document document,
	Reference targetReference
)
Public Shared Function IsReferenceAValidEdgeForConstraint (
	document As Document,
	targetReference As Reference
) As Boolean
public:
static bool IsReferenceAValidEdgeForConstraint(
	Document^ document,
	Reference^ targetReference
)
static member IsReferenceAValidEdgeForConstraint :
        document : Document *
        targetReference : Reference -> bool
Parameters
document Document
 The document that contains the reference.
targetReference Reference
 The reference to be checked.
Return Value
Boolean
 Returns true if reference can be used in a constraint of 'ToHostEdge' or 'ToHostEdgeCover' type, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace